#pragma once
//------------------------------------------------------------------------------
// 이벤트를 전달하기위한 기본객체클래스
//------------------------------------------------------------------------------
template<typename T1, typename T2>
class GSTMessage
{
	T1 _id;
	T2 _data;

public:
	virtual ~GSTMessage() {}
	const T1& GetId()	{ return _id; }
	const T2& GetData() { return _data; }
};	

//------------------------------------------------------------------------------
// 메세지 온리 처리를 위한 클래스
//------------------------------------------------------------------------------
class GTSMessageNone
{
};

